---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR
source: html/c863162b-2ce3-dd72-ffc8-3a408297089a.htm
---
# StructuralSectionGeneralR Properties

Common set of parameters for structural analysis.